#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/heder24/juicebox/runs/run-bbGhDW8EdH3GVnr8

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...
module.prod_asg.data.aws_partition.current: Refreshing...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Refreshing...
data.aws_route53_zone.heder_lab_zone: Refreshing...
module.prod_bastion.data.aws_partition.current: Refreshing...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Refreshing...
module.base-ec2-role.data.aws_caller_identity.current: Refreshing...
data.aws_eip.bastion_eip: Refreshing...
module.base-ec2-role.data.aws_partition.current: Refreshing...
module.prod_asg.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.prod_asg.data.aws_default_tags.current: Refreshing...
module.base-ec2-role.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Refresh complete after 0s [id=2053943846]
module.prod_bastion.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Refresh complete after 0s [id=1021377347]
data.aws_availability_zones.available: Refreshing...
module.prod_asg.data.aws_default_tags.current: Refresh complete after 0s [id=aws]
data.aws_ami.ubuntu: Refreshing...
module.base-ec2-role.data.aws_caller_identity.current: Refresh complete after 0s [id=312029113425]
module.base-ec2-role.data.aws_iam_policy_document.assume_role[0]: Refreshing...
module.base-ec2-role.data.aws_iam_policy_document.assume_role[0]: Refresh complete after 0s [id=3095392050]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-2]
data.aws_eip.bastion_eip: Refresh complete after 0s [id=eipalloc-003f1118979070f7a]
data.aws_ami.ubuntu: Refresh complete after 0s [id=ami-073e5edf4b5d15fc8]
data.aws_route53_zone.heder_lab_zone: Refresh complete after 0s [id=Z10479661QT4EPRK5O3JF]
module.dns_records.data.aws_route53_zone.this[0]: Refreshing...
module.dns_records.data.aws_route53_zone.this[0]: Refresh complete after 1s [id=Z10479661QT4EPRK5O3JF]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip_association.eip_assoc will be created
  + resource "aws_eip_association" "eip_assoc" {
      + allocation_id        = "eipalloc-003f1118979070f7a"
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = true
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = "ipv4"
      + load_balancer_type                          = "application"
      + name                                        = "prod"
      + name_prefix                                 = (known after apply)
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags                                        = {
          + "MyLoadBalancer" = "prod-lb"
          + "Name"           = "prod"
        }
      + tags_all                                    = {
          + "MyLoadBalancer" = "prod-lb"
          + "Name"           = "prod"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "10"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = "false"
      + name                               = (known after apply)
      + name_prefix                        = "prod"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "InstanceTargetGroupTag" = "prod"
          + "Name"                   = "prod"
        }
      + tags_all                           = {
          + "InstanceTargetGroupTag" = "prod"
          + "Name"                   = "prod"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health.html"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 6
          + unhealthy_threshold = 3
        }
    }

  # module.alb.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "prod-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "prod"
        }
      + tags_all               = {
          + "Name" = "prod"
        }
      + vpc_id                 = (known after apply)
    }

  # module.base-ec2-role.aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "base-ec2-role-1"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "base-ec2-role-1"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.base-ec2-role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = []
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "base-ec2-role-1"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.base-ec2-role.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "base-ec2-role-1"
    }

  # module.base-ec2-role.aws_iam_role_policy_attachment.custom[1] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMFullAccess"
      + role       = "base-ec2-role-1"
    }

  # module.bastion_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "prod-bastion-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "prod-bastion-sg"
        }
      + tags_all               = {
          + "Name" = "prod-bastion-sg"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.bastion_sg.aws_security_group_rule.computed_egress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "computed_egress_with_source_security_group_id" {
      + description              = "SSH"
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # module.bastion_sg.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow SSH from public IPV4"
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.bastion_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      + description              = "Allow SSH from public IPV6"
      + from_port                = 22
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.dns_records.aws_route53_record.this["hederdevops.com A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "hederdevops.com"
      + type            = "A"
      + zone_id         = "Z10479661QT4EPRK5O3JF"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.dns_records.aws_route53_record.this["www.hederdevops.com A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.hederdevops.com"
      + type            = "A"
      + zone_id         = "Z10479661QT4EPRK5O3JF"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.private_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "prod-private-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "prod-private-sg"
        }
      + tags_all               = {
          + "Name" = "prod-private-sg"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.private_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "computed_ingress_with_source_security_group_id" {
      + description              = "SSH from bastion"
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.private_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[1] will be created
  + resource "aws_security_group_rule" "computed_ingress_with_source_security_group_id" {
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.private_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[2] will be created
  + resource "aws_security_group_rule" "computed_ingress_with_source_security_group_id" {
      + description              = "HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.private_sg.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress Rule"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.private_sg.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_ipv6_cidr_blocks" {
      + description              = "HTTP to anywhere IPV4"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.prod_asg.aws_autoscaling_group.idc[0] will be created
  + resource "aws_autoscaling_group" "idc" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + default_instance_warmup          = 300
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "prod"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = []
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "0"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "GithubOrg"
          + propagate_at_launch = true
          + value               = "hederdevops"
        }
      + tag {
          + key                 = "GithubRepo"
          + propagate_at_launch = true
          + value               = "heder-class-devops"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "prod-web"
        }

      + timeouts {}
    }

  # module.prod_asg.aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "prod launch template"
      + id                     = (known after apply)
      + image_id               = "ami-073e5edf4b5d15fc8"
      + instance_type          = "t2.micro"
      + key_name               = "main-us-east-2"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "lt-prod-"
      + tags                   = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all               = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + update_default_version = true
      + user_data              = "IyEvYmluL2Jhc2gKCiNVbmluc3RhbGwgVW5vZmZpY2lhbCB2ZXJzaW9ucyAKCmZvciBwa2cgaW4gZG9ja2VyLmlvIGRvY2tlci1kb2MgZG9ja2VyLWNvbXBvc2UgZG9ja2VyLWNvbXBvc2UtdjIgcG9kbWFuLWRvY2tlciBjb250YWluZXJkIHJ1bmM7IGRvIHN1ZG8gYXB0IHJlbW92ZSAkcGtnIC15OyBkb25lCgojIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjICBTZXQgdXAgRG9ja2VyJ3MgQXB0IHJlcG9zaXRvcnkuICMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIwojIEFkZCBEb2NrZXIncyBvZmZpY2lhbCBHUEcga2V5OgpzdWRvIGFwdC1nZXQgdXBkYXRlIC15CnN1ZG8gYXB0LWdldCBpbnN0YWxsIGNhLWNlcnRpZmljYXRlcyBjdXJsIGdudXBnIC15CnN1ZG8gaW5zdGFsbCAtbSAwNzU1IC1kIC9ldGMvYXB0L2tleXJpbmdzCmN1cmwgLWZzU0wgaHR0cHM6Ly9kb3dubG9hZC5kb2NrZXIuY29tL2xpbnV4L3VidW50dS9ncGcgfCBzdWRvIGdwZyAtLWRlYXJtb3IgLW8gL2V0Yy9hcHQva2V5cmluZ3MvZG9ja2VyLmdwZwpzdWRvIGNobW9kIGErciAvZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnIAoKIyBBZGQgdGhlIHJlcG9zaXRvcnkgdG8gQXB0IHNvdXJjZXM6CmVjaG8gXAogICJkZWIgW2FyY2g9IiQoZHBrZyAtLXByaW50LWFyY2hpdGVjdHVyZSkiIHNpZ25lZC1ieT0vZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnXSBodHRwczovL2Rvd25sb2FkLmRvY2tlci5jb20vbGludXgvdWJ1bnR1IFwKICAiJCguIC9ldGMvb3MtcmVsZWFzZSAmJiBlY2hvICIkVkVSU0lPTl9DT0RFTkFNRSIpIiBzdGFibGUiIHwgXAogIHN1ZG8gdGVlIC9ldGMvYXB0L3NvdXJjZXMubGlzdC5kL2RvY2tlci5saXN0ID4gL2Rldi9udWxsCnN1ZG8gYXB0LWdldCB1cGRhdGUgLXkKCgojaW5zdGFsbCB0aGUgRG9ja2VyIHBhY2thZ2VzLiAKCnN1ZG8gYXB0LWdldCBpbnN0YWxsIGRvY2tlci1jZSBkb2NrZXItY2UtY2xpIGNvbnRhaW5lcmQuaW8gZG9ja2VyLWJ1aWxkeC1wbHVnaW4gZG9ja2VyLWNvbXBvc2UtcGx1Z2luIC15CgoKIyBTdGFydCBhbmQgRW5hYmxlIERvY2tlciAKc3VkbyBzZXJ2aWNlIGRvY2tlciBzdGFydApzdWRvIHNlcnZpY2UgZG9ja2VyIGVuYWJsZQoKI0FkZCB1c2VyIGN5YmVyIHRvIGRvY2tlciBncm91cCBhbmQgVXBkYXRlIERvY2tlciBQZXJtaXNzaW9uIApzdWRvIHVzZXJtb2QgLWEgLUcgZG9ja2VyIGN5YmVyCnN1ZG8gY2htb2QgNjY2IC92YXIvcnVuL2RvY2tlci5zb2NrCgojIFJ1biBPV0FTUCBKdWljZSBTaG9wIENvbnRhaW5lcgoKZG9ja2VyIHB1bGwgYmtpbW1pbmljaC9qdWljZS1zaG9wCmRvY2tlciBydW4gLWQgLXAgODA6MzAwMCBia2ltbWluaWNoL2p1aWNlLXNob3A="

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + delete_on_termination = "true"
          + description           = "eth0"
          + device_index          = 0
          + security_groups       = (known after apply)
        }

      + placement {
          + availability_zone = "eu-east-2b"
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "GithubOrg"  = "hederdevops"
              + "GithubRepo" = "heder-class-devops"
              + "Name"       = "prod"
              + "WhatAmI"    = "Instance"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "GithubOrg"  = "hederdevops"
              + "GithubRepo" = "heder-class-devops"
              + "Name"       = "prod"
              + "WhatAmI"    = "Volume"
            }
        }
    }

  # module.prod_bastion.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-073e5edf4b5d15fc8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-2a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "main-us-east-2"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "prod-bastion"
        }
      + tags_all                             = {
          + "Name" = "prod-bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = true
      + volume_tags                          = {
          + "Name" = "prod-bastion"
        }
      + vpc_security_group_ids               = (known after apply)

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + timeouts {}
    }

  # module.public_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "prod-public-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "prod-public-sg"
        }
      + tags_all               = {
          + "Name" = "prod-public-sg"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.public_sg.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS to anywhere IPV4"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.public_sg.aws_security_group_rule.egress_with_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTP to anywhere IPV4"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.public_sg.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_ipv6_cidr_blocks" {
      + description              = "HTTP to anywhere IPV4"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.public_sg.aws_security_group_rule.egress_with_ipv6_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "egress_with_ipv6_cidr_blocks" {
      + description              = "HTTPS to anywhere IPV4"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.public_sg.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow HTTPS from public IPV4"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.public_sg.aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow HTTP from public IPV4"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.public_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      + description              = "HTTPS from public IPV6"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.public_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      + description              = "HTTP from public IPV6"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.vpc.aws_cloudwatch_log_group.flow_log[0] will be created
  + resource "aws_cloudwatch_log_group" "flow_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all          = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all             = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_flow_log.this[0] will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 60
      + tags                     = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all                 = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "vpc-flow-log-to-cloudwatch-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AWSVPCFlowLogsPushToCloudWatch"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all    = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
    }

  # module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = "AWSVPCFlowLogsAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "vpc-flow-log-role-"
      + path                  = "/"
      + tags                  = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all              = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + unique_id             = (known after apply)
    }

  # module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all                           = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all         = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all         = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all                                       = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all                                       = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all                                       = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all                                       = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all                                       = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all                                       = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.70.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
      + tags_all                             = {
          + "GithubOrg"  = "hederdevops"
          + "GithubRepo" = "heder-class-devops"
          + "Name"       = "prod"
        }
    }

Plan: 58 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name                                = (known after apply)
  + alb_zone_id                                 = (known after apply)
  + allocation_id                               = "eipalloc-003f1118979070f7a"
  + ami_id                                      = "ami-073e5edf4b5d15fc8"
  + base-ec2-role                               = "base-ec2-role-1"
  + bastion_sg_security_group_id                = (known after apply)
  + cgw_arns                                    = []
  + cgw_ids                                     = []
  + database_nat_gateway_route_ids              = []
  + database_route_table_association_ids        = []
  + database_route_table_ids                    = [
      + (known after apply),
    ]
  + database_subnet_arns                        = []
  + database_subnets                            = []
  + database_subnets_cidr_blocks                = []
  + database_subnets_ipv6_cidr_blocks           = []
  + default_network_acl_id                      = (known after apply)
  + default_route_table_id                      = (known after apply)
  + default_security_group_id                   = (known after apply)
  + ec2_id                                      = (known after apply)
  + elasticache_route_table_association_ids     = []
  + elasticache_route_table_ids                 = (known after apply)
  + elasticache_subnet_arns                     = []
  + elasticache_subnets                         = []
  + elasticache_subnets_cidr_blocks             = []
  + elasticache_subnets_ipv6_cidr_blocks        = []
  + iam_instance_profile_id                     = (known after apply)
  + igw_arn                                     = (known after apply)
  + igw_id                                      = (known after apply)
  + intra_route_table_association_ids           = []
  + intra_route_table_ids                       = []
  + intra_subnet_arns                           = []
  + intra_subnets                               = []
  + intra_subnets_cidr_blocks                   = []
  + intra_subnets_ipv6_cidr_blocks              = []
  + nat_ids                                     = [
      + (known after apply),
    ]
  + nat_public_ips                              = [
      + (known after apply),
    ]
  + natgw_ids                                   = [
      + (known after apply),
    ]
  + outpost_subnet_arns                         = []
  + outpost_subnets                             = []
  + outpost_subnets_cidr_blocks                 = []
  + outpost_subnets_ipv6_cidr_blocks            = []
  + private_ipv6_egress_route_ids               = []
  + private_nat_gateway_route_ids               = [
      + (known after apply),
    ]
  + private_route_table_association_ids         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_route_table_ids                     = [
      + (known after apply),
    ]
  + private_sg_security_group_id                = (known after apply)
  + private_subnet_arns                         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets                             = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets_cidr_blocks                 = [
      + "10.70.0.0/24",
      + "10.70.1.0/24",
      + "10.70.2.0/24",
    ]
  + private_subnets_ipv6_cidr_blocks            = []
  + public_internet_gateway_route_id            = (known after apply)
  + public_route_table_association_ids          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_route_table_ids                      = [
      + (known after apply),
    ]
  + public_subnet_arns                          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets                              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets_cidr_blocks                  = [
      + "10.70.4.0/24",
      + "10.70.5.0/24",
      + "10.70.6.0/24",
    ]
  + public_subnets_ipv6_cidr_blocks             = []
  + redshift_public_route_table_association_ids = []
  + redshift_route_table_association_ids        = []
  + redshift_route_table_ids                    = [
      + (known after apply),
    ]
  + redshift_subnet_arns                        = []
  + redshift_subnets                            = []
  + redshift_subnets_cidr_blocks                = []
  + redshift_subnets_ipv6_cidr_blocks           = []
  + security_group_arn                          = (known after apply)
  + security_group_description                  = "Security Group managed by Terraform"
  + security_group_id                           = (known after apply)
  + security_group_name                         = (known after apply)
  + security_group_owner_id                     = (known after apply)
  + security_group_vpc_id                       = (known after apply)
  + this_customer_gateway                       = {}
  + vpc_arn                                     = (known after apply)
  + vpc_cidr_block                              = "10.70.0.0/16"
  + vpc_enable_dns_hostnames                    = true
  + vpc_enable_dns_support                      = true
  + vpc_flow_log_cloudwatch_iam_role_arn        = (known after apply)
  + vpc_flow_log_destination_arn                = (known after apply)
  + vpc_flow_log_destination_type               = "cloud-watch-logs"
  + vpc_flow_log_id                             = (known after apply)
  + vpc_id                                      = (known after apply)
  + vpc_instance_tenancy                        = "default"
  + vpc_ipv6_association_id                     = (known after apply)
  + vpc_ipv6_cidr_block                         = (known after apply)
  + vpc_main_route_table_id                     = (known after apply)
  + vpc_owner_id                                = (known after apply)
  + vpc_secondary_cidr_blocks                   = []
  + zone_id                                     = "Z10479661QT4EPRK5O3JF"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @heder24, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*